WeightLossDiary/src/Documents/Питание/Питание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Питание</name>
  <registerRecords>AccumulationRegister.Калории</registerRecords>
  <attributes>
    <name>ВремяДня</name>
    <type>
      <types>EnumRef.ВремяДня</types>
    </type>
  </attributes>
  <attributes>
    <name>Калории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПитания</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>КалорийностьПродукта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Масса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКалорий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WeightLossDiary/src/Documents/Питание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТаблицаПитанияПродуктПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	КалорийностьПродукта = ПолучитьКалорийностьПродукта(ТекДанные.Продукт);
	ТекДанные.КалорийностьПродукта = КалорийностьПродукта;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКалорийностьПродукта(Продукт)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукты.КалорийностьПродукта КАК КалорийностьПродукта
		|ИЗ
		|	Справочник.Продукты КАК Продукты
		|ГДЕ
		|	Продукты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Продукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КалорийностьПродукта;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПитанияМассаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	ТекДанные.КоличествоКалорий = Окр((ТекДанные.Масса * ТекДанные.КалорийностьПродукта) / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПитанияКоличествоКалорийПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	ТекДанные.Масса = ?(ТекДанные.КалорийностьПродукта = 0, 0, Окр((ТекДанные.КоличествоКалорий * 100) / ТекДанные.КалорийностьПродукта));
	
КонецПроцедуры
